{
  "source_pdf": "PZO2033E-cropped.pdf",
  "book_name": "Abomination_Vaults",
  "total_sections": 11,
  "extraction_methods": [
    "pymupdf"
  ],
  "total_pages": 258,
  "pages_with_content": 258,
  "sections": [
    {
      "type": "front_matter",
      "number": 0,
      "title": "Front Matter",
      "start_page": 1,
      "end_page": 2,
      "filename": "00_front_matter.txt"
    },
    {
      "type": "chapter",
      "number": 1,
      "title": "A Light in the Fog When the fog is creeping, And the moon is low; When the town is sleeping, Gauntlight starts to glow! That’s when she arises For her midnight lunch. Naughty kids are prizes For her teeth to crunch. But if you obey me, And obey the rules; You’re safe from Belcorra; She just eats the fools! So warns a popular nursery rhyme among the parents in the town of Otari, as they often sing the melodious",
      "start_page": 22,
      "end_page": 37,
      "filename": "01_chapter_1_a_light_in_the_fog_when_the_fog_is_creeping_and_th.txt"
    },
    {
      "type": "chapter",
      "number": 2,
      "title": "The Forgotten Dungeon While the heroes are free to enter the dungeon below the keep as soon as they discover any of its entrances, an important event should take place before they dive too deeply into the Abomination Vaults. It’s best if this event takes place at night while the heroes have line of sight to Gauntlight’s cupola, such as when they retreat to rest or perhaps even right after they’ve defeated the vampiric mist in area A25. In any case, the heroes should be 2nd level for this event. When the timing is right, begin Deadtide for Otari. Deadtide for Otari Gauntlight isn’t yet fully functional, but enough of its magical power has been restored that Belcorra activates it as a test ﬁring before proceeding with",
      "start_page": 38,
      "end_page": 53,
      "filename": "02_chapter_2_the_forgotten_dungeon_while_the_heroes_are_free_to.txt"
    },
    {
      "type": "chapter",
      "number": 3,
      "title": "Cult of the Canker The third level of the Abomination Vaults once served as Belcorra’s sprawling library and rooms related to research. The servants and librarians once employed here have become dangerous undead creatures. Library Features Belcorra’s library is unlit except where otherwise noted. Ceilings are 8 feet high in halls and 10 feet high in rooms, although the largest rooms and halls have vaulted ceilings that rise to 12 feet high. Doors are made of wood, and many are marked with signs (described in area C11) to help scholars ﬁnd their way. The Cult of the Canker is the most widespread faction active in the library. Originally a collection of librarians, caretakers, and scribes, this loyal staff",
      "start_page": 54,
      "end_page": 71,
      "filename": "03_chapter_3_cult_of_the_canker_the_third_level_of_the_abominat.txt"
    },
    {
      "type": "chapter",
      "number": 4,
      "title": "Long Dream the Dead The fourth level of the Abomination Vaults is one of the smaller ones overall, yet it’s among the ﬁnest, as it once served as Belcorra’s personal retreat. Belcorra’s Retreat Features Ceilings in this level are 10 feet tall in halls and 15 feet in rooms. Unless otherwise indicated, rooms are unlit. The doors are iron-banded wood; ephemeral spirits gently shut any door left open for more than a minute. The map for this level appears on page 70. D1. BELCORRA’S DINING ROOM MODERATE 4 A pair of brightly glowing chandeliers illuminates a long banquet table surrounded by luxurious, high-backed chairs. The table is still set as if for a grand meal, but some of the",
      "start_page": 72,
      "end_page": 85,
      "filename": "04_chapter_4_long_dream_the_dead_the_fourth_level_of_the_abomin.txt"
    },
    {
      "type": "chapter",
      "number": 5,
      "title": "Into the Training Grounds While the upper levels of Belcorra’s massive dungeon were primarily for her personal use, she designed the middle levels for work. Belcorra trawled the Darklands for dangerous predators and bloodthirsty aberrations, but their feral power wasn’t enough for her. She needed to mold them into an army to assault the metropolis of Absalom. In the middle levels, she had these forces forged for battle, in body and in mind. The ﬁfth level thus included a massive arena and training grounds where gladiators would ﬁght for the right to lead her monstrous troops. In the Darklands, Belcorra encountered wormlike aberrations called seugathis, who had a curious eagerness to serve her. She then repurposed the sixth",
      "start_page": 86,
      "end_page": 107,
      "filename": "05_chapter_5_into_the_training_grounds_while_the_upper_levels_o.txt"
    },
    {
      "type": "chapter",
      "number": 6,
      "title": "Experiments in Flesh Under Belcorra, the Abomination Vault’s sixth level was split between support for the arena above and the laboratories that created new and terrible monsters. The two activities weren’t all that separate since the most powerful of the monsters created in the laboratories fought in the arena, where the survivors joined Belcorra’s growing ranks of monsters to assault Absalom. Conversely, failures in the arena became fodder for further experiments in the laboratories. When Belcorra died, the overbearing control of a bone devil named Tarkannah initially kept inﬁghting on this level at a minimum, but many creatures chafed at Tarkannah’s control. The seugathi ﬂeshwarper Jafaki organized a coup and murdered the bone devil,",
      "start_page": 108,
      "end_page": 127,
      "filename": "06_chapter_6_experiments_in_flesh_under_belcorra_the_abominatio.txt"
    },
    {
      "type": "chapter",
      "number": 7,
      "title": "Soul Keepers Five centuries ago, Belcorra summoned the contract devil Urevian to administer her Abomination Vaults. Always looking to sweeten a deal, Urevian further offered to train Belcorra’s armies and lead her invasion of Absalom—for a price. Urevian knew that Vol Rajani, legendary Roseguard swordswoman and exiled royalty from Nidal, lived in Absalom. The Rajani family has, for reasons even Urevian doesn’t know, special value to certain parties in Hell. In exchange for Urevian’s aid, Belcorra guaranteed him Rajani’s soul. When the Roseguard attacked Gauntlight, bringing the soul right to Belcorra’s doorstep, Urevian was in Hell, committing Rajani’s soul to a much more powerful entity—even though he didn’t yet have it. By the time he returned,",
      "start_page": 128,
      "end_page": 145,
      "filename": "07_chapter_7_soul_keepers_five_centuries_ago_belcorra_summoned_.txt"
    },
    {
      "type": "chapter",
      "number": 8,
      "title": "Decaying Gardens Gauntlight is active, but its true power is yet to be realized. Belcorra penetrated deep underground to build Gauntlight’s foundation, following the psychic pull of the Empty Vault, a place sacred to Nhimbaloth at the heart of an ancient, subterranean temple. Gauntlight draws upon the energies of the Empty Vault as its foundation and the source of its powers. Within the Empty Vault, Belcorra empowered four fulcrum lenses that, when installed in the lighthouse high above, focus Nhimbaloth’s attention and unleash the artifact’s full power. But the fulcrum lenses are dangerous; they invite Nhimbaloth’s uncaring gaze, and even Belcorra can’t withstand the scrutiny of the Outer God. Thus, though they hold great power, the fulcrum lenses are",
      "start_page": 146,
      "end_page": 167,
      "filename": "08_chapter_8_decaying_gardens_gauntlight_is_active_but_its_true.txt"
    },
    {
      "type": "chapter",
      "number": 9,
      "title": "On the Hunt As any explorer of the Darklands can tell you, the farther you descend, the wilder and stranger things become. As Belcorra dug the Abomination Vaults deeper, she found an extensive system of caverns. Unlike the self-contained Farm level, these caverns were truly wild. At ﬁrst, she fought against the ﬁerce denizens and tried to close off the passages to deeper places, but the task was futile. She dubbed the place the Hunting Grounds and left it mostly alone, save for building alliances with the communities there. Belcorra established only a few strongholds in the area, including a lodge, a vault, and the entrance to the Gate of Nhimbaloth, the subterranean temple holding the Empty Vault and the source of Gauntlight’s power.",
      "start_page": 168,
      "end_page": 195,
      "filename": "09_chapter_9_on_the_hunt.txt"
    },
    {
      "type": "chapter",
      "number": 10,
      "title": "To Draw the Baleful Glare Perhaps a few of the vaults’ inhabitants know the true story of Nhimbaloth’s ancient temple—notably Lady’s Whisper and maybe a dread wisp or two—but none will tell the tale. Was it the hub of a cult cast deep into the earth by some ancient enemy, or the headquarters of a Darklands cabal? No matter its original purpose, the complex series of initiation trials are the last challenges that the heroes must face to confront Belcorra. The ﬁrst is the Challenge of Souls, where unworthy initiates were poisoned, tormented, and had their souls extracted. The second is the Challenge of Despair, where initiates faced their greatest fears. The last test is the Challenge of the Swamp, where initiates demonstrated their mastery over swampland dangers. The heroes are likely to face these",
      "start_page": 196,
      "end_page": 258,
      "filename": "10_chapter_10_to_draw_the_baleful_glare.txt"
    }
  ]
}